/*2253744 林觉凯 软工*/
#include "mine_sweeper.h"
/***************************************************************************
  函数名称：Main_Menu()
  功    能：打印主菜单（游戏选项）并且返回一个选择
  输入参数：无
  返 回 值：一个选择（int型的choice）
  说    明：无
***************************************************************************/
int Main_menu()
{
	cout << "------------------------------------------" << endl;
	cout << "1.选择难度并显示内部数组" << endl;
	cout << "2.输入初始位置并显示被打开的初始区域" << endl;
	cout << "3.内部数组基础版" << endl;
	cout << "4.内部数组完整版（标记、运行时间）" << endl;
	cout << "5.画出伪图形化框架并显示内部数据" << endl;
	cout << "6.检测鼠标位置和合法性（左键单击退出）" << endl;
	cout << "7.鼠标选择初始位置并显示被打开的初始区域" << endl;
	cout << "8.伪图形界面基础版" << endl;
	cout << "9.伪图形界面完整版" << endl;
	cout << "0.退出游戏" << endl;
	cout << "------------------------------------------" << endl;
	cout << "[请选择] :";
	cct_gotoxy(11, 12);
	while (1)
	{
		char keydown = _getch();
		if (keydown >= '0' && keydown <= '9')
			return (keydown - '0');
		else
			continue;
	}
}
/***************************************************************************
  函数名称：Sub_Menu()
  功    能：打印副菜单（游戏难度选择）并且返回一个选择
  输入参数：无
  返 回 值：一个选择（int型的difficulty）
  说    明：无
***************************************************************************/
int Sub_menu()
{
	cout << "请选择难度：" << endl;
	cout << "  1.初级( 9*9  - 10颗雷)" << endl;
	cout << "  2.中级(16*16 - 40颗雷)" << endl;
	cout << "  3.高级(16*30 - 99颗雷)" << endl;
	cout << "请输入[1..3]：";
	cct_gotoxy(14, 4);
	while (1)
	{
		char keydown = _getch();
		if (keydown >= '1' && keydown <= '3')
		{
			cct_cls();
			return (keydown - '0');
		}
		else
			continue;
	}
}